{
  "name": "jazirah-ilmu",
  "description": "Video Essay Investigatif & Intelektual - 5 fase dengan pendekatan dokumenter, berbasis data/sejarah, menghindari kesan ceramah/menggurui",
  "version": "3.0-GoldenStandard",
  "phases": [
    {
      "id": "opening-hook",
      "name": "The Cold Open (Hook)",
      "order": 1,
      "durationTarget": {
        "min": 60,
        "max": 90
      },
      "wordCountTarget": {
        "min": 130,
        "max": 200
      },
      "requiredElements": [
        "Cold Open: Langsung masuk ke narasi/cerita TANPA salam pembuka",
        "Kalimat PANJANG MENGALIR dari awal (WAJIB) - JANGAN mulai dengan kalimat pendek-terpisah",
        "Misteri: Bangun ketegangan/pertanyaan besar sebelum menyebut topik utama",
        "Statement paradoks atau fakta kontraintuitif yang menantang asumsi umum",
        "Framing topik sebagai misteri intelektual, bukan sekadar nasehat moral"
      ],
      "forbiddenPatterns": [
        "Mengucapkan salam/halo di awal audio (HARAM)",
        "Bayangkan...",
        "Pernahkah Anda berpikir...",
        "Pada kesempatan ini...",
        "Pertanyaan retoris yang klise/lemah (misal: 'Tahukah kamu?')",
        "Kalimat pembuka yang bertele-tele",
        "Kalimat pendek-terpisah di awal seperti 'Menunduk dalam. Khusyuk. Mata tak berkedip' - GUNAKAN kalimat panjang mengalir"
      ],
      "guidanceTemplate": "Mulai dengan 'Cold Open' seperti dokumenter Jazirah Ilmu. JANGAN ucapkan salam. MULAI dengan kalimat PANJANG yang mengalir. Contoh JI: 'Dunia hari ini terlihat tenang. Layar menyala, pasar bergerak, teknologi berkembang seolah semuanya terkendali. Tapi di balik itu semua, ada satu titik rapuh...' atau 'Sejak manusia mengenal kekuasaan, ada satu pola yang selalu berulang di hampir semua peradaban, yaitu penguasa tidak pernah puas hanya disebut kuat...'",
      "customRules": {
        "cognitiveDisturbance": "high",
        "hookStyle": "Investigative Mystery",
        "coldOpen": "true"
      },
      "emotionalArc": "Intrik (Misteri) -> Skeptis (Paradoks) -> Ingin Tahu (Hook)",
      "openingExamples": [
        "Contoh 1 (Smartphone Addiction): 'Dunia hari ini terlihat tenang. Layar menyala, pasar bergerak, teknologi berkembang seolah semuanya terkendali. Tapi di balik itu semua, ada satu titik rapuh yang menahan seluruh sistem agar tidak runtuh, dan titik rapuh itu berada tepat di telapak tangan kita. Sejarah mencatat bahwa manusia pernah mengelilingi patung batu, membungkuk pada berhala yang terukir dari kayu, dan menyembah sosok yang mereka ciptakan sendiri dengan tangan mereka sendiri. Kita sering mengira tradisi tersebut telah lama mati, terkubur oleh masa dan kemajuan peradaban. Namun, cobalah lihat ke sekeliling ruangan ini saat ini. Di setiap sudut, terdapat puluh bahkan ratusan orang yang menunduk dalam keheningan, mata tak berkedip menatap cahaya buatan, jempol bergerak ritmis tanpa henti, seolah mereka sedang melakukan ritual ibadah yang abadi.'",
        "Contoh 2 (Social Media Validation): 'Sejak manusia mengenal kekuasaan, ada satu pola yang selalu berulang di hampir semua peradaban, yaitu penguasa tidak pernah puas hanya disebut kuat. Mereka ingin disebut sah, suci, dan ditakdirkan, dan mereka akan melakukan segala cara untuk melegitimasi posisi tersebut, termasuk menulis ulang sejarah dan menciptakan silsilah dewa. Di abad ke-21, pola yang sama muncul kembali, tetapi bukan di istana kerajaan atau takhta kekaisaran, melainkan di kantong celana dan dompet setiap orang. Kita sekarang memiliki mata uang baru yang menentukan nilai diri seseorang, dan mata uang itu diberi nama yang sangat sederhana: like. Sebuah angka yang muncul di layar ketika seseorang menyetujui keberadaan kita, sebuah tanda bahwa kita dilihat, diakui, dan dianggap ada.'",
        "Contoh 3 (Climate Eschatology): 'Ada satu masa dalam sejarah umat manusia ketika seluruh peradaban merasa sudah mencapai puncak kejayaan. Gedung-gedung menjulang, perdagangan berkembang, dan ilmu pengetahuan maju pesat seolah-olah tidak ada batas lagi yang bisa ditembus. Namun di balik kemegahan yang tampak itu, ada satu kebenaran yang sering terlupakan: segala sesuatu yang naik, suatu saat akan turun. Kitab suci umat berbagai agama telah mencatat fenomena ini ribuan tahun yang lalu, bukan sebagai ramalan mistis, melainkan sebagai pola sejarah yang berulang. Peradaban besar bangkit, mencapai puncak kejayaan, dan kemudian runtuh bukan karena serangan musuh dari luar, melainkan karena keropos dari dalam.'",
        "Contoh 4 (Wealth Materialism): 'Nabi Muhammad Shallallahu alaihi wa sallam pernah bersabda tentang golongan orang yang akan celaka, dan beliau menyebut mereka dengan sebutan yang sangat spesifik: Hamba dinar, hamba dirham. Dalam bahasa Arab klasik, kata abdu berarti hamba sahaya, seseorang yang sepenuhnya dimiliki oleh tuannya, yang tidak memiliki kebebasan untuk bergerak tanpa izin. Di masa kini, mata uangnya mungkin berubah namanya, tetapi pola perilaku tetap sama. Kita mungkin tidak lagi menyembah koin emas dan perak secara fisik, tetapi hati kita masih dapat diperbudak oleh sesuatu yang lebih halus, lebih abstrak, namun jauh lebih kuat cengkeramnya.'"
      ]
    },
    {
      "id": "contextualization",
      "name": "The Hidden Reality (Data & Context)",
      "order": 2,
      "durationTarget": {
        "min": 180,
        "max": 240
      },
      "wordCountTarget": {
        "min": 400,
        "max": 550
      },
      "requiredElements": [
        "Minimal 2 DATA KERAS (Angka, Tahun, Nama Tokoh, Lokasi Spesifik)",
        "Studi kasus nyata atau peristiwa sejarah yang JARANG diketahui",
        "High Stakes: Jelaskan konsekuensi vital jika masalah ini dibiarkan (e.g., Kehancuran sistem, Perang, Hilangnya iman)",
        "Definisi ulang masalah: Mengubah persepsi audiens dari 'ini masalah biasa' menjadi 'ini masalah sistemik/krusial'",
        "Kalimat transisi yang menghubungkan makro (dunia) ke mikro (kita)"
      ],
      "forbiddenPatterns": [
        "Generalisasi tanpa bukti ('Banyak orang berkata...')",
        "Kutipan dalil tanpa konteks realitas",
        "Bahasa yang terlalu abstrak/filosofis tanpa pijakan bumi"
      ],
      "guidanceTemplate": "Jangan ceramah. Tunjukkan BUKTI. Sebutkan tahun kejadian, nama perjanjian, jumlah korban, atau statistik spesifik. Jangan hanya mendefinisikan masalah; ceritakan apa yang DIPERTARUHKAN (The Stakes). Buat audiens merasa 'lebih pintar' setelah mendengar bagian ini.",
      "transitionHint": "Namun, data sejarah mencatat anomali yang mengerikan...",
      "customRules": {
        "mustHaveConcreteData": "true",
        "narrativeMode": "Expository-Analytic"
      },
      "emotionalArc": "Terkejut (Fakta baru) -> Rasional (Analisis) -> Concern (Implikasi)"
    },
    {
      "id": "multi-dimensi",
      "name": "The Systematic Breakdown (Progressive Escalation)",
      "order": 3,
      "durationTarget": {
        "min": 480,
        "max": 600
      },
      "wordCountTarget": {
        "min": 1000,
        "max": 1300
      },
      "requiredElements": [
        "The Domino Effect: Jelaskan bagaimana satu sebab kecil memicu kehancuran besar (Sebab-Akibat Material)",
        "The Psychological Trap: Analisis sisi gelap psikologi manusia/behavioral science",
        "The Ultimate Consequence (Eskatologi): Perspektif akhir zaman yang rasional (bukan mistis)",
        "Penggunaan istilah teknis yang tepat (misal: 'Hedonic Treadmill', 'Cognitive Dissonance', 'Istidraj')",
        "Studi kasus pembanding (Komparasi zaman dulu vs sekarang dengan detail)"
      ],
      "forbiddenPatterns": [
        "Pengulangan poin yang sama dengan kata berbeda",
        "Judgemental language ('Kita semua berdosa', 'Anda salah')",
        "Bahasa 'langit' yang tidak membumi",
        "Menjelaskan definisi istilah tanpa konteks cerita (Kamus berjalan)"
      ],
      "guidanceTemplate": "Gunakan struktur 'Progressive Escalation'. Masalah ini bukan cuma soal X, tapi memicu Y, dan akhirnya menghancurkan Z. Setiap paragraf harus menaikkan taruhan (raise the stakes). Gunakan perspektif multidisiplin (Sains + Agama). JANGAN kaku seperti skripsi.",
      "transitionHint": "Dan di sinilah letak ironi terbesarnya...",
      "customRules": {
        "progressiveStakes": "true",
        "interdisciplinary": "true"
      },
      "emotionalArc": "Fokus (Analisis mendalam) -> Gelisah (Koneksi ke realitas diri) -> Takut/Awe (Skala masalah membesar)"
    },
    {
      "id": "climax",
      "name": "The Critical Junction (Reality Check)",
      "order": 4,
      "durationTarget": {
        "min": 240,
        "max": 300
      },
      "wordCountTarget": {
        "min": 500,
        "max": 650
      },
      "requiredElements": [
        "Satu METAFORA VISUAL yang menyentuh PERASAAN (bukan cuma logika)",
        "Konfrontasi intelektual: Menghadapkan audiens pada pilihan logis, bukan emosional murahan",
        "Call to Mind (bukan just Call to Action): Mengubah cara pikir",
        "Penggunaan 'Silent Pauses' dalam naskah untuk efek dramatis"
      ],
      "forbiddenPatterns": [
        "Menangis-nangis atau over-dramatisasi",
        "Solusi instan/gampangan ('Pokoknya tobat')",
        "Menyalahkan pihak tertentu secara vulgar",
        "Dramatic pauses format seperti '(Hening total selama 3 detik. Layar gelap gulita)' - gunakan narasi visual saja",
        "Direct confrontation questions like 'Siapa Tuanmu?' tanpa konteks - gunakan metafor visual yang lebih halus"
      ],
      "guidanceTemplate": "Hantam dengan realitas. Bongkar ilusi kenyamanan. Gunakan kalimat pendek, tajam, dan ritmik (Staccato). Jangan minta audiens berubah, tapi tunjukkan konsekuensi logis jika TIDAK berubah.",
      "transitionHint": "Maka, kita tersudut pada satu pertanyaan yang tak bisa dihindari...",
      "customRules": {
        "sentenceStyle": "Staccato (Short, Punchy)",
        "visualMetaphor": "required"
      },
      "emotionalArc": "Tegang (Konfrontasi) -> Hening (Refleksi) -> Tercerahkan (Shift perspective)"
    },
    {
      "id": "eschatology",
      "name": "The Humble Conclusion (Epilogue)",
      "order": 5,
      "durationTarget": {
        "min": 180,
        "max": 240
      },
      "wordCountTarget": {
        "min": 350,
        "max": 500
      },
      "requiredElements": [
        "Zoom out: Kembali ke *big picture*",
        "Open loop: Pertanyaan yang dibawa pulang (lingering thought)",
        "Closing statement yang rendah hati (Sikap 'Kita sama-sama belajar')",
        "Salam penutup lengkap"
      ],
      "forbiddenPatterns": [
        "Kesimpulan yang mematikan diskusi (Absolute ending)",
        "Kesan 'Saya lebih suci dari Anda'",
        "Promosi berlebihan"
      ],
      "guidanceTemplate": "Tutup dengan elegan. Jangan simpulkan semuanya untuk audiens; biarkan mereka menyimpulkan sendiri. Posisi narator: Teman berpikir, bukan guru moral.",
      "transitionHint": "Pada akhirnya, sejarah akan mencatat pilihan kita...",
      "customRules": {
        "humility": "max",
        "lingeringThought": "true"
      },
      "emotionalArc": "Reda (De-escalation) -> Hangat (Connection) -> Kontemplatif (Closing)"
    }
  ],
  "globalRules": {
    "tone": "Video Essay Dokumenter: Cinematic Tension, Cerdas tapi Membumi (Smart Casual). Hindari bahasa akademis yang kaku atau istilah teknis yang tidak perlu.",
    "voice": "Investigative Journalist meets Storyteller. Bicara seperti menjelaskan ke teman pintar, bukan kuliah dosen.",
    "perspective": "Objective Observer. Gunakan 'Kita' untuk refleksi bersama.",
    "vocabulary": "Gunakan Bahasa Indonesia baku yang ENARIC (Enak Dibaca & Didengar). Hindari istilah sains/teknis yang membuat kening berkerut (misal: 'variabel', 'kausalitas', 'anomali data' -> GANTI DENGAN 'faktor', 'sebab-akibat', 'keanehan').",
    "narrativeStructure": "Progressive Escalation (Maju & Membesar) & High Stakes Building (Membangun Taruhan).",
    "intellectualSurprise": "Setiap fase HARUS menyajikan minimal 1 fakta/insight baru.",
    "authoritativeGuidelines": "Sebutkan perbedaan pendapat ulama (Khilafiyah) secara adil. Hindari narasi absolut/tunggal pada masalah khilafiyah.",
    "referenceRequirement": "Setiap dalil/klaim agama WAJIB menyertakan referensi (Nama Kitab, Nomor Hadits, atau Derajat Hadits). Jangan kutip 'Kata Ulama' tanpa nama.",
    "narrativeHumility": "Gunakan frasa kerendahan hati: 'Wallahu a'lam', 'Menurut sebagian pendapat', untuk menghindari kesan otoriter.",
    "language": "Bahasa Indonesia"
  },
  "styleCharacteristics": {
    "visualThinking": "Tulis naskah untuk MATA (Visual). Deskripsikan adegan nyata.",
    "dataIntegration": "Sebutkan data secara natural dalam kalimat, jangan kaku.",
    "rhetoricalStrategy": "Ajak audiens berpikir kritis dengan bahasa sehari-hari yang tajam."
  },
  "productionChecklist": {
    "factCheck": [
      "Apakah ada Data Keras (Angka/Nama/Tahun)?",
      "Apakah ada Studi Kasus Nyata?"
    ],
    "toneCheck": [
      "Apakah bahasanya terlalu 'tinggi/ilmiah'? Jika ya, SEDERHANAKAN.",
      "Apakah terdengar pretensius? Gunakan 'Bahasa Manusia' saja.",
      "Apakah ada 'Intellectual Surprise'?"
    ]
  },
  "exampleTopics": [
    "Geopolitik Chip Semikonduktor (TSMC)",
    "Sejarah Mata Uang Fiat & Riba",
    "Psikologi Massa di Era Algoritma",
    "Keruntuhan Peradaban Islam Andalusia (Studi Kasus)",
    "Eskatologi Iklim & Lingkungan"
  ],
  "forbiddenPhrases": [
    "Marilah kita...",
    "Sungguh sayang sekali...",
    "Wahai saudaraku yang budiman...",
    "Betapa indahnya jika...",
    "Alangkah ruginya...",
    "Secara teknis...",
    "Variabel determinan...",
    "Anomali data...",
    "Korelasi linear...",
    "Residu energi..."
  ]
}